# WallTypeDefaultTaperedExteriorInwardAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallTypeDefaultTaperedExteriorInwardAngle Property
ParameterTypeId Class See Also
---
"Default Exterior Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallTypeDefaultTaperedExteriorInwardAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTypeDefaultTaperedExteriorInwardAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallTypeDefaultTaperedExteriorInwardAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace